{"jobTitle": "Applications Programmer", "company": "Albireo Energy", "body": "Albireo Energy is a national building automation, energy services, and electrical power monitoring system provider. Their solutions and services help building owners and managers improve efficiency and reduce operational costs while improving comfort for tenants. With access to industry-leading technologies from Schneider Electric, Albireo Energy provides superior services and solutions to data centers, healthcare, biosciences, government and commercial real estate. www.albireoenergy.com Basic Purpose of Position: In addition to the responsibilities below, the Applications Programmer will be responsible for the overall success of software design, database creation, and the implementation of procedures and standards used in the programming of controls projects.Responsibilities:A key member of the Albireo team, the Applications Programmer will be responsible for developing program and operator interface graphics of building automation systems to include, but not limited to: Review of project specifications, drawings and project specific documents to establish project intent. Breakdown scope of work into manageable segments and post to Project Manager for scheduling. Attend or receive meeting minutes from graphics review meetings with customers. Posting project programming specific “Request for Information: (RFI) documentation to Application Engineer, Project Manager and Operations Manager. Follow sequence of operations as required by project documents and engineered sequence of operations, utilizing established standards. Production of project specific as-builts based upon initial project construction drawings and field modification mark-ups. Graphic development and creation using TGML, while following and helping to improve company standards  * Work independently or be part of small collaborative teams. Work with field technicians to troubleshoot and take corrective action to software issues. Troubleshoot and correct BMS integration issues. Qualifications: Bachelor’s degree in Mechanical Engineering, Electrical Engineering or Computer Science is preferred. Degree may be offset by 5-7 years of experience with the production of ATC/BAS systems. Understanding of mechanical HVAC equipment. Thorough understanding of electrical and network wiring and the programming of BAS components. Excellent computer skills and strong understanding of MS Office products (Word, Excel, Access); AutoCAD, Visual Basic, Visio. Effective interpersonal skills to represent the company to customers and other outside contacts in an ethical and professional manner. Strong understanding of Modbus and BACnet protocols and integration of these technologies into BMS systems. Job Type: Full-time Experience: BAS: 1 year (Preferred) AutoCAD: 1 year (Preferred)"}