{"jobTitle": "Full Stack Developer", "company": "TopView Sightseeing", "body": "Full Stack Developer  Job Description TopView Sightseeing is a New York-based double decker bus company offering a variety of sightseeing tours by bus, bike, and boat. Our growing team of native local experts serve over 1,500 customers daily, and visitors to the Big Apple can experience New York City with unforgettable views. As we are building our new brand, we are growing tremendously and launching new websites and digital products to enhance the customer experience across our network of brands including Bike Rental Central Park and Water Tours New York. This position is for a full-time, on-site Full Stack Developer with 4-5 years of experience. Responsibilities include, but are not limited to:  Create in-house web applications. Bug fix, QA, problem solve. Maintain, update, and improve existing company e-commerce websites. Implement websites, landing pages, and applications from concept through deployment, with a responsive, mobile-first approach. Create API endpoints. Working closely with other team members in the development team. Integrate and improve custom back-end reporting systems. Qualifications:  BS in Computer Science or equivalent strong experience. PHP (4-5 years of experience). Strong knowledge of HTML, CSS, Javascript. Strong experience with MVC frameworks. Laravel is a plus. Infrastructure, system admin, and performance tuning experience. Experience working with internal and third party APIs (REST, SOAP, JSON, OAUTH). Unit testing is a plus. Knowledge of CMS & CRM systems. Experience working with relational databases, complex queries, and database normalization. Ability to write clean, scalable/modular code through source control. Experience with Git is required. Ability to follow directions and adheres to timelines and project plans. Good communication skills, ability to mentor and work collaboratively. Job Type: Full-time Salary: $70,000.00 to $100,000.00 /year Location: New York, NY (Required)"}