{"jobTitle": "Entry Level Software Analyst", "company": "Workforce Opportunity Services", "body": " This program provides NO COST, comprehensive training to highly motivated individuals. If selected for the program, you will receive customized training, followed by Full-Time employment with our partner, PSEG in Newark. This unique work-study opportunity differs from the typical job. Our solution, for those who are ready, will put you on the right personal, academic, and professional path while providing the necessary support and mentorship to help keep you there. This program will focus on Full Stack Development Due to the accelerated training timeline and intense curriculum being taught, the successful candidate will should have prior working knowledge in software development. Post 9/11 Veteran-honorably discharged or currently serving in the National Guard / Reserve OR Individual pursuing a Computer Science, or related degree Availability to work Full-Time Phase 1 - Academics (13 Weeks):\nFull-Time Academics\nClasses will be held Monday – Friday during normal business hours\nTraining will include:\nFull Stack Development\nInterpersonal Skills\nAcademic Compensation: $500/Week Stipend.\nThis stipend is a miscellaneous payment (Form 1099) and is required to be reported to IRS when filing taxes.\n Full-Time Academics Classes will be held Monday – Friday during normal business hours Training will include:\nFull Stack Development\nInterpersonal Skills\n Full Stack Development Interpersonal Skills Academic Compensation: $500/Week Stipend.\nThis stipend is a miscellaneous payment (Form 1099) and is required to be reported to IRS when filing taxes.\n This stipend is a miscellaneous payment (Form 1099) and is required to be reported to IRS when filing taxes. Phase 2 - Work/Study (13 Weeks):\nFull-Time work with an Academic component\nThroughout the program you will receive continued support and mentorship to ensure your success\nWork/Study Compensation: $14.80/Hour (Plus Benefits after 90 days)\n Full-Time work with an Academic component Throughout the program you will receive continued support and mentorship to ensure your success Work/Study Compensation: $14.80/Hour (Plus Benefits after 90 days) Phase 3 - Full-Time Consultancy (30+ Weeks):\nFull-Time work\nFull-Time consultancy will last a minimum of 30 weeks, after which, you will be eligible for hire at PSEG\nWork/Study Compensation: $18.50/Hour (Plus Benefits)\n Full-Time work Full-Time consultancy will last a minimum of 30 weeks, after which, you will be eligible for hire at PSEG Work/Study Compensation: $18.50/Hour (Plus Benefits) Phase 1: New York, NY (Manhattan) Phase 2/3: Newark, NJ "}